tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/avr"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
brew "act"
brew "avrdude"
brew "arduino-cli"
brew "clang-format"
brew "cmake"
brew "erdtree"
brew "exa"
brew "fzf"
brew "git"
brew "helix"
brew "jdtls"
brew "lua-language-server"
brew "marksman"
brew "maven"
brew "neovim"
brew "nnn"
brew "node"
brew "openjdk"
brew "pandoc"
brew "pnpm"
brew "pyright"
brew "python-lsp-server"
brew "rust-analyzer"
brew "rustup"
brew "skhd"
brew "taplo"
brew "tmux"
brew "tree"
brew "typescript-language-server"
brew "typst"
brew "vscode-langservers-extracted"
brew "wget"
brew "yabai"
brew "yarn"
brew "osx-cross/avr/avr-binutils"
brew "osx-cross/avr/avr-gcc"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
cask "alacritty"
cask "anaconda"
cask "anki"
cask "blockbench"
cask "cheatsheet"
cask "docker"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
#cask "hammerspoon"
cask "iterm2"
cask "keybase"
cask "languagetool"
cask "logi-options-plus"
cask "mactex-no-gui"
cask "messenger"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "minecraft"
cask "mochi"
cask "obsidian"
cask "popcorn-time"
cask "raspberry-pi-imager"
cask "ultimaker-cura"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zotero"
