tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"

# Zsh
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Lsp
brew "lua-language-server"
brew "marksman"
brew "pyright"
brew "python-lsp-server"
brew "taplo"
brew "typescript-language-server"
brew "vscode-langservers-extracted"

# Fonts
cask "font-caskaydia-cove-nerd-font"

# Productivity
cask "alacritty"
cask "cheatsheet"
cask "drawio"
cask "languagetool"
cask "logi-options-plus"
cask "messenger"
cask "microsoft-edge"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "mochi"
cask "obsidian"
cask "zotero"

# Devtools
brew "act"
brew "clang-format"
brew "cmake"
brew "exa"
brew "fzf"
brew "git"
brew "helix"
brew "nnn"
brew "pnpm"
brew "rust-analyzer"
brew "rustup"
brew "typst"
brew "wget"
cask "anaconda"
cask "mactex-no-gui"
cask "raspberry-pi-imager"

# Misc.
brew "node"
brew "tmux"
brew "zoxide"
cask "docker"
cask "minecraft"
cask "popcorn-time"
cask "ultimaker-cura"
cask "virtualbox"
cask "vlc"
